package challenge.afor.technology.songbidhan;

import android.content.Intent;
import android.os.Bundle;
import android.support.v7.app.AppCompatActivity;
import android.util.DisplayMetrics;
import android.util.Log;
import android.widget.ImageView;
import android.widget.LinearLayout;
import android.widget.TextView;

public class Detailed_Advice extends AppCompatActivity {
    TextView tv1;
    ImageView im1;
    int selector;
    int height,width;
    LinearLayout linearLayout;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_detailed__advice);
        tv1=(TextView)findViewById(R.id.ingradients);


        Intent intent=getIntent();
        selector=intent.getIntExtra("position",0)+1;
        Log.d("Selector",">>>>"+selector);
        DisplayMetrics displayMetrics = this.getResources().getDisplayMetrics();
        width = displayMetrics.widthPixels;
        height = displayMetrics.heightPixels;
//        final  RelativeLayout.LayoutParams params = (RelativeLayout.LayoutParams) linearLayout.getLayoutParams();
//        params.height=height/4;
//        linearLayout.setLayoutParams(params);
        tv1.setTextSize(20);



        if(selector==1)
        {
            tv1.setText("প্ররা মৌনি আবিনিম বাংজ সংবি\n\n" +
                    "---------------------------------\n\n" +
                    "১। প্র- প্রজাতন্ত্র (১-৭)\n\n" +
                    "২। রা- রাষ্ট্র পরিচালনার মূলনীতি (৮-২৫)\n\n" +
                    "৩। মৌ- মৌলিক অধিকার (২৬-৪৭)\n\n" +
                    "৪। নি- নির্বাহী বিভাগ (৪৮-৬৪)\n\n" +
                    "৫। আ- আইনসভা (৬৫-৯৩)\n\n" +
                    "৬। বি- বিচার বিভাগ (৯৪-১১৭)\n\n" +
                    "৭। নি- নির্বাচন (১১৮-১২৬)\n\n" +
                    "৮। ম- মহাহিসাব নিরীক্ষক ও নিয়ন্ত্রক (১২৭-১৩২)\n\n" +
                    "৯। বাং- বাংলাদেশের কর্মবিভাগ (১৩৩-১৪১)\n\n" +
                    "৯ক। জ- জরুরী বিধানাবলী (১৪১ক-১৪১গ)\n\n" +
                    "১০। সং- সংবিধান সংশোধন (১৪২)\n\n" +
                    "১১। বি- বিবিধ (১৪৩-১৫৩)");
            setTitle("সংবিধানের ১১টি ভাগ ");
        }

        else if(selector==2)
        {
            tv1.setText("১- প্রজাতন্ত্র\n\n" +
                    "২- প্রজাতন্ত্রের রাষ্ট্রীয় সীমানা\n\n" +
                    "২ক- রাষ্ট্রধর্ম\n\n" +
                    "৩- রাষ্ট্রভাষা\n\n" +
                    "৪- জাতীয় সঙ্গীত, পতাকা ও প্রতীক\n\n" +
                    "৪ক- জাতির পিতার প্রতিকৃতি\n\n" +
                    "৫- রাজধানী\n\n" +
                    "৬- নাগরিকত্ব\n\n" +
                    "৭- সংবিধানের প্রাধান্য\n\n" +
                    "৮- মূলনীতিসমূহ\n\n" +
                    "৮- জাতীয়তাবাদ\n\n" +
                    "১০- সমাজতন্ত্র ও শোষনমুক্তি\n\n" +
                    "১১- গণতন্ত্র ও মানবাধিকার\n\n" +
                    "১২- ধর্মনিরপেক্ষতা ও ধর্মীয় স্বাধীনতা।");

            setTitle("অনুচ্ছেদ : ১-১২");
        }
        else if(selector==3)
        {
            tv1.setText("মালিক কৃষককে মৌ গ্রামে নিয়ে গিয়ে " +
                    "অবৈতনিক জনস্বাস্থ্যের জন্য সুযোগের সমতা সৃষ্টি করতে বলল। " +
                    "এতে অধিকার ও কর্তব্যরূপে নাগরিকরা নির্বাহী বিভাগ " +
                    "থেকে জাতীয় সংস্কৃতি ও জাতীয় স্মৃতি নিদর্শনের জন্য " +
                    "আন্তর্জাতিক শান্তির অংশীদার হলেন।\n\n" +
                    "--------------------------------------------- \n\n" +
                    "১৩- মালিক-  মালিকানার নীতি\n\n" +
                    "১৪- কৃষক-  কৃষক ও শ্রমিকের মুক্তি\n\n" +
                    "১৫- মৌ-  মৌলিক প্রয়োজনের ব্যবস্থা\n\n" +
                    "১৬- গ্রাম-  গ্রামীণ উন্নয়ন ও কৃষি বিপ্লব\n\n" +
                    "১৭- অবৈতনিক-  অবৈতনিক ও বাধ্যতামূলক শিক্ষা\n\n" +
                    "১৮- জনস্বাস্থ্য-  জনস্বাস্থ্য ও নৈতিকতা\n\n" +
                    "১৯- সুযোগের সমতা-  সুযোগের সমতা\n\n" +
                    "২০- অধিকার ও কর্তব্যরূপে-  অধিকার ও কর্তব্যরূপে কর্ম\n\n" +
                    "২১- নাগরিক-  নাগরিক ও সরকারি কর্মচারীদের কর্তব্য\n\n" +
                    "২২- নির্বাহী বিভাগ থেকে-  নির্বাহী বিভাগ হইতে বিচার" +
                    "বিভাগের পৃথকীকরণ\n\n" +
                    "২৩- জাতীয় সংস্কৃতি-  জাতীয় সংস্কৃতি\n\n" +
                    "২৪- জাতীয় স্মৃতি নিদর্শন-  জাতীয় স্মৃতিনিদর্শন প্রভৃতি\n\n" +
                    "২৫- আন্তর্জাতিক শান্তি-  আন্তর্জাতিক শান্তি," +
                    "নিরাপত্তা ও সংহতির উন্নয়ন।\n\n" );

            setTitle("অনুচ্ছেদ : ১৩-২৫");
        }
        else if(selector==4)
        {
            tv1.setText("মৌলিক অধিকারের আইনের দৃষ্টিতে ধর্ম, " +
                    "সরকারি নিয়োগ ও বিদেশী খেতাব গ্রহণে সকলের " +
                    "আইনের আশ্রয় লাভের অধিকার রয়েছে। জীবনে ১ বার " +
                    "গ্রেপ্তার হলে জবরদস্তি বিচার হয়।\n\n" +
                    "----------------------------------------------------\n\n" +
                    "২৬-মৌলিক অধিকারের-  মৌলিক অধিকারের সহিত " +
                    "অসামঞ্জস্য আইন বাতিল\n\n" +
                    "২৭-আইনের দৃষ্টিতে-  আইনের দৃষ্টিতে সমতা\n\n" +
                    "২৮-ধর্ম-  ধর্ম প্রভৃতি কারনে বৈষম্য\n\n" +
                    "২৯-সরকারি নিয়োগ-  সরকারি নিয়োগ লাভের সুযোগের " +
                    "সমতা\n\n" +
                    "৩০-বিদেশী খেতাব গ্রহণে-  বিদেশী খেতাব প্রভৃতি গ্রহণ " +
                    "নিষিদ্ধ করণ\n\n" +
                    "৩১-আইনের আশ্রয় লাভের অধিকার-  আইনের আশ্রয় " +
                    "লাভের অধিকার\n\n" +
                    "৩২-জীবনে-জীবন ও ব্যক্তি-  স্বাধীনতার অধিকার রক্ষণ\n\n" +
                    "৩৩-গ্রেপ্তার-  গ্রেপ্তার ও আটক সম্পর্কে রক্ষাকবচ\n\n" +
                    "৩৪-জবরদস্তি-  জবরদস্তি-শ্রম নিষিদ্ধকরণ\n\n" +
                    "৩৫-বিচার-বিচার ও দন্ড সম্পর্কে রক্ষণ।");

            setTitle("অনুচ্ছেদ : ২৬-৩৫");
        }
        else if(selector==5)
        {
            tv1.setText("চল, সমাবেশ ও সংগঠন করি! চিন্তা, পেশা, ধর্" +
                    "ম, সম্পত্তি ও যোগাযোগের অধিকার বলবত্ করি। \n\n" +
                    "----------------------------------------------------\n\n" +
                    "৩৬- চল- চলাফেরার স্বাধীনতা\n\n" +
                    "৩৭- সমাবেশ- সমাবেশের স্বাধীনতা\n\n" +
                    "৩৮- সংগঠন- সংগঠনের স্বাধীনতা\n\n" +
                    "৩৯- চিন্তা- চিন্তা ও বিবেকের স্বাধীনতা এবং বাক-" +
                    "স্বাধীনতা\n\n" +
                    "৪০- পেশা-  পেশা বা বৃত্তির স্বাধীনতা\n\n" +
                    "৪১- ধর্ম-  ধর্মীয় স্বাধীনতা\n\n" +
                    "৪২- সম্পত্তি-  সম্পত্তির অধিকার\n\n" +
                    "৪৩- যোগাযোগের-  গৃহ ও যোগাযোগের রক্ষণ\n\n" +
                    "৪৪- অধিকার-  মৌলিক অধিকার বলবতকরণ।");

            setTitle("অনুচ্ছেদ : ৩৬-৪৪");
        }
        else if(selector==6)
        {
            tv1.setText("রাষ্ট্রপতি তার ক্ষমার মেয়াদে দায়মুক্তি " +
                    "পেতে অভিশংসন ও অপসারনের ক্ষমতা স্পীকারকে " +
                    "দিলেন।\n\n" +
                    "--------------------------------------------- \n\n" +
                    "৪৮-রাষ্ট্রপতি-  রাষ্ট্রপতি\n\n" +
                    "৪৯-ক্ষমার-  ক্ষমা প্রদর্শনের অধিকার\n\n" +
                    "৫০-মেয়াদে-  রাষ্ট্রপতি-পদের মেয়াদ\n\n" +
                    "৫১-দায়মুক্তি-  রাষ্ট্রপতির দায়মুক্তি\n\n" +
                    "৫২-অভিশংসন-  রাষ্ট্রপতির অভিশংসন\n\n" +
                    "৫৩-অপসারনের-  অসামর্থের কারনে রাষ্ট্রপতির অপসারন\n\n" +
                    "৫৪-স্পীকার-  অনুপস্থিতি প্রভৃতির কালে রাষ্ট্রপতি-পদে " +
                    "স্পীকার।");

            setTitle("অনুচ্ছেদ : ৪৮-৫৪");
        }
        else if(selector==7)
        {
            tv1.setText("মন্ত্রিসভায় মন্ত্রীগণ প্রধানমন্ত্রী ও " +
                    "অন্যান্য মন্ত্রীর পদের মেয়াদ ঠিক করেন।\n\n" +
                    "--------------------------------------------- \n\n" +
                    "৫৫-মন্ত্রিসভায়-  মন্ত্রীসভা\n\n" +
                    "৫৬-মন্ত্রীগণ-  মন্ত্রীগণ\n\n" +
                    "৫৭-প্রধানমন্ত্রী-  প্রধানমন্ত্রী পদের মেয়াদ\n\n" +
                    "৫৮-অন্যান্য মন্ত্রীর পদের মেয়াদ-  অন্যান্য মন্ত্রীর পদের " +
                    "মেয়াদ।");

            setTitle("অনুচ্ছেদ : ৫৫-৫৮");
        }
        else if(selector==8)
        {
            tv1.setText("সংসদ সদস্যগণ শূন্য পারিশ্রমিকে অর্থদন্ড ও " +
                    "পদত্যাগের কারনে দ্বৈত অধিবেশনে ভাষনের অধিকার " +
                    "স্পীকারকে দিলেন। কিন্তু কোরাম না থাকায় স্থায়ী " +
                    "কমিটি ন্যায়পাল নিয়োগে বিশেষ অধিকার ও দায়মুক্তি " +
                    "পেতে সচিবালয় গঠন করেন।\n\n" +
                    "--------------------------------------------- \n\n" +
                    "৬৫-সংসদ-  সংসদ প্রতিষ্ঠা\n\n" +
                    "৬৬-সদস্যগণ-  সংসদের নির্বাচিত হইবার যোগ্যতা ও " +
                    "অযোগ্যতা\n\n" +
                    "৬৭-  শূন্য-সংসদের আসন শূন্য হওয়া\n\n" +
                    "৬৮-পারিশ্রমিকে-  সংসদ সদস্যদের পারিশ্রমিক প্রভৃতি\n\n" +
                    "৬৯-অর্থদন্ড-  শপথ গ্রহণের পূর্বে আসন গ্রহণ বা ভোটদান" +
                    "করিলে সদস্যের অর্থদন্ড\n\n" +
                    "৭০-পদত্যাগের কারনে-  রাজনৈতিক দল হইতে পদত্যাগ বা " +
                    "দলের বিপক্ষে ভোটদানের কারনে আসন শূন্য হওয়া\n\n" +
                    "৭১-দ্বৈত-  দ্বৈত সদস্যতায় বাধা\n\n" +
                    "৭২-অধিবেশনে-  সংসদের অধিবেশন\n\n" +
                    "৭৩-ভাষণের-  সংসদে রাষ্ট্রপতির ভাষণ ও বাণী\n\n" +
                    "৭৩ক-অধিকার-  সংসদ সম্পর্কে মন্ত্রীগণের অধিকার\n\n" +
                    "৭৪-স্পীকার-  স্পীকার ও ডেপুটি স্পীকার\n\n" +
                    "৭৫-কোরাম-  কার্যপ্রণালী-বিধি, কোরাম প্রভৃতি\n\n" +
                    "৭৬-স্থায়ী কমিটি-  সংসদের স্থায়ী কমিটিসমূহ\n\n" +
                    "৭৭-ন্যায়পাল-  ন্যায়পাল\n\n" +
                    "৭৮-  বিশেষ অধিকার ও দায়মুক্তি-সংসদ ও সদস্যদের " +
                    "বিশেষ-অধিকার ও দায়মুক্তি\n\n" +
                    "৭৯-সচিবালয়-সংসদ সচিবালয়।"
            );

            setTitle("অনুচ্ছেদ : ৬৫-৭৯");
        }

        else if(selector==9)
        {
            tv1.setText("১৮ (ক) – পরিবেশ সংক্রান্ত\n\n" +
                    "২৭- আইনের দৃষ্টিতে সমতা \n\n" +
                    "২৮(২)- নারী পুরুষের সম অধিকার\n\n" +
                    "২৯ – সরকারি নিয়োগ লাভে সমতার সুযোগ\n\n" +
                    "৪৬- দায়মুক্তি বিধানের ক্ষমতা\n\n" +
                    "৪৭- যুদ্ধাপরাধ \n\n" +
                    "৪৮- রাষ্ট্রপতি \n\n" +
                    "৫৬- প্রধানমন্ত্রী নিয়োগ \n\n" +
                    "৬৩- যুদ্ধ\n\n" +
                    "৬৪- এটর্নি জেনারেল \n\n" +
                    "৭০- নিজ দলের বিপক্ষে ভোটদান \n\n" +
                    "৭৭- ন্যায়পাল \n\n" +
                    "৮১- অর্থবিল\n\n" +
                    "৯৩- অধ্যাদেশ প্রণয়নের ক্ষমতা\n\n" +
                    "৯৪- সুপ্রিম কোর্ট প্রতিষ্ঠা \n\n" +
                    "৯৫- বিচারক নিয়োগ\n\n" +
                    "১১৮- নির্বাচন কমিশন প্রতিষ্ঠা \n\n" +
                    "১২২- ভোটার তালিকায় নামভুক্তির যোগ্যতা\n\n" +
                    "১২৭- মহাহিসাব নিরীক্ষক \n\n" +
                    "১৩৭- কর্মকমিশন \n\n" +
                    "১৪১- জরুরি অবস্থা \n\n" +
                    "১৪২- সংবিধান সংশোধন \n\n" +
                    "১৪৫- আন্তর্জাতিক চুক্তি\n\n" +
                    "১৪৮- পদের শপথ \n\n"
            );
            setTitle("অন্যান্য গুরুত্বপূর্ণ ধারা");

        }


        else if(selector==10)
        {
            tv1.setText("তৃতীয় তফসিল:  শপথ\n\n" +
                    "চতুর্থ তফসিল:  ক্রান্তিকালীন ও অস্থায়ী বিধান \n\n" +
                    "পঞ্চম তফসিল:  ৭ ই মার্চের ভাষণ\n\n" +
                    "ষষ্ঠ তফসিল:  স্বাধীনতার ঘোষণা \n\n" +
                    "সপ্তম তফসিল:  ১০ এপ্রিলের ঘোষণাপত্র\n\n"
            );
            setTitle("তফসিল");

        }

        else if(selector==11)
        {
            tv1.setText("১) বাংলাদেশে কোন ধরনের রাষ্ট্রীয় ব্যবস্থা প্রচলিত?\n" +
                    "\n" +
                    "উঃ- সার্বভৌম প্রজাতন্ত্র।\n" +
                    "\n" +
                    "২) গণপ্রজাতন্ত্রী বাংলাদেশের সর্বোচ্চ আইন কি?\n" +
                    "\n" +
                    "উঃ- সংবিধান।\n" +
                    "\n" +
                    "৩) কোন দেশের কোন লিখিত সংবিধান নাই?\n" +
                    "\n" +
                    "উঃ- বৃটেন, নিউজিল্যান্ড, স্পেন ও সৌদি আরব।\n" +
                    "\n" +
                    "৪) বিশ্বের সবচেয়ে বড় সংবিধান কোন দেশের?\n" +
                    "\n" +
                    "উঃ- ভারত।\n" +
                    "\n" +
                    "৫) বিশ্বের সবচেয়ে ছোট সংবিধান কোন দেশের?\n" +
                    "\n" +
                    "উঃ- আমেরিকা।\n" +
                    "\n" +
                    "৬) বাংলাদেশের সংবিধানের প্রনয়ণের প্রক্রিয়া শুরু হয় কবে?\n" +
                    "\n" +
                    "উঃ- ২৩ মার্চ, ১৯৭২।\n" +
                    "\n" +
                    "৭) বাংলাদেশের সংবিধান কবে উত্থাপিত হয়?\n" +
                    "\n" +
                    "উঃ- ১২ অক্টোবর, ১৯৭২।\n" +
                    "\n" +
                    "৮) গনপরিষদে কবে সংবিধান গৃহীত হয়?\n" +
                    "\n" +
                    "উঃ- ০৪ নভেম্বর,১৯৭২।\n" +
                    "\n" +
                    "৯) কোন তারিখে বাংলাদেশের সংবিধান বলবৎ হয়?\n" +
                    "\n" +
                    "উঃ- ১৬ ডিসেম্বর, ১৯৭২।\n" +
                    "\n" +
                    "১০) বাংলাদেশে গনপরিষদের প্রথম অধিবেশন কবে অনুষ্ঠিত হয়?\n" +
                    "\n" +
                    "উঃ- ১০ এপ্রিল, ১৯৭২।\n" +
                    "\n" +
                    "১১) সংবিধান প্রনয়ণ কমিটি কতজন সদস্য নিয়ে গঠন করা হয়?\n" +
                    "\n" +
                    "উঃ- ৩৪ জন।\n" +
                    "\n" +
                    "১২) সংবিধান রচনা কমিটির প্রধান কে ছিলেন?\n" +
                    "\n" +
                    "উঃ- ডঃ কামাল হোসেন।\n" +
                    "\n" +
                    "১৩) সংবিধান রচনা কমিটির একমাত্র মহিলা সদস্য কে ছিলেন?\n" +
                    "\n" +
                    "উঃ- বেগম রাজিয়া বেগম।\n" +
                    "\n" +
                    "১৪) বাংলাদেশ সংবিধানের কয়টি পাঠ কয়েছে?\n" +
                    "\n" +
                    "উঃ- ২ টি। বাংলা ও ইংরেজি।\n" +
                    "\n" +
                    "১৫) কি দিয়ে বাংলাদেশের সংবিধান শুরু ও শেষ হয়েছে?\n" +
                    "\n" +
                    "উঃ- প্রস্তাবনা দিয়ে শুরু ও ৭টি তফসিল দিয়ে শেষ।\n" +
                    "\n" +
                    "১৬) বাংলাদেশের সংবিধানে কয়টি ভাগ আছে?\n" +
                    "\n" +
                    "উঃ- ১১ টি।\n" +
                    "\n" +
                    "১৭) বাংলাদেশের সংবিধানের অনুচ্ছেদ/ধারা কতটি?\n" +
                    "\n" +
                    "উঃ- ১৫৩ টি।\n" +
                    "\n" +
                    "১৮) বাংলাদশের প্রথম হস্তলেখা সংবিধানের মূল লেখক কে?\n" +
                    "\n" +
                    "উঃ- আবদুর রাউফ।\n" +
                    "\n" +
                    "১৯) প্রধানমন্ত্রীর পরামর্শ ছাড়া কোন কাজ রাষ্ট্রপতি এককভাবে করতে সক্ষম?\n" +
                    "\n" +
                    "উঃ- প্রধান বিচারপতির নিয়োগ দান।\n" +
                    "\n" +
                    "২০) রাষ্ট্রপতির মেয়াদকাল কত বছর?\n" +
                    "\n" +
                    "উঃ- কার্যভার গ্রহনের কাল থেকে ৫ বছর।\n" +
                    "\n" +
                    "২১) একজন ব্যক্তি বাংলাদশের রাষ্ট্রপতি হতে পারবেন কত মেয়াদকাল?\n" +
                    "\n" +
                    "উঃ- ২ মেয়াদকাল।\n" +
                    "\n" +
                    "২২) কার উপর আদালতের কোন এখতিয়ার নেই?\n" +
                    "\n" +
                    "উঃ- রাষ্ট্রপতি।\n" +
                    "\n" +
                    "২৩) জাতীয় সংসদের সভাপতি কে?\n" +
                    "\n" +
                    "উঃ- স্পিকার।\n" +
                    "\n" +
                    "২৪) রাষ্ট্রপতি পদত্যাগ করতে চাইলে কাকে উদ্দেশ্য করে পদত্যাগ পত্র লিখবেন?\n" +
                    "\n" +
                    "উঃ- স্পিকারের উদ্দেশ্যে।\n" +
                    "\n" +
                    "২৫) প্রধানমন্ত্রী, মন্ত্রী, প্রতিমন্ত্রী ও উপ-মন্ত্রীদের নিয়োগ প্রদান করেন কে?\n" +
                    "\n" +
                    "উঃ- রাষ্ট্রপতি।\n" +
                    "\n" +
                    "২৬) এ্যার্টনি জেনারেল পদে নিয়োগ দান করেন কে?\n" +
                    "\n" +
                    "উঃ- রাষ্ট্রপতি।\n" +
                    "\n" +
                    "২৭) সংবিধানের প্রধান বৈশিষ্ট্য আছে কতটি?\n" +
                    "\n" +
                    "উ: ১২টি।\n" +
                    "\n" +
                    "২৮) বাংলাদেশের সর্বোচ্চ আদালত কোনটি?\n" +
                    "\n" +
                    "উঃ- সুপ্রীম কোর্ট।\n" +
                    "\n" +
                    "২৯) সুপ্রীম কোর্টের কয়টি বিভাগ আছে?\n" +
                    "\n" +
                    "উঃ- ২টি । আপিল বিভাগ ও হাইকোর্ট বিভাগ।\n" +
                    "\n" +
                    "৩০) সুপ্রীম কোর্টের বিচারপতিদের মেয়াদকাল কত?\n" +
                    "\n" +
                    "উঃ- ৬৭ বছর পর্যন্তু।\n" +
                    "\n" +
                    "৩১) বাংলাদেশের সংবিধানের প্রথম মূলনীতি কি ছিল?\n" +
                    "\n" +
                    "উঃ- ধর্মনিরপেক্ষতা, জাতীয়তাবাদ, গনতন্ত্র ও সমাজতন্ত্র।\n" +
                    "\n" +
                    "৩২) কোন আদেশবলে সংবিধানের মূলনীতি “ধর্মনিরপেক্ষতা” বাদ দেয়া হয়?\n" +
                    "\n" +
                    "উঃ- ১৯৭৮ সনে ২য় ঘোষনাপত্র আদেশ নং ৪ এর ২ তফসিল বলে।\n" +
                    "\n" +
                    "৩৩) কোন আদেশবলে সংবিধানেরশুরুতে “বিসমিল্লাহির রাহমানির রাহিম” সন্নিবেশিত হয়?\n" +
                    "\n" +
                    "উঃ- ১৯৭৮ সনে ২য় ঘোষনাপত্র আদেশ নং ৪ এর ২ তফসিল বলে।\n" +
                    "\n" +
                    "৩৪) কোন আদেশবলে বাংলাদেশের নাগরিকগণ “বাংলাদেশী” বলে পরিচিত হন?\n" +
                    "\n" +
                    "উঃ- ১৯৭৮ সনে ২য় ঘোষনাপত্র আদেশ নং ৪ এর ২ তফসিল বলে।\n" +
                    "\n" +
                    "৩৫) সংবিধানের কোন অনুচ্ছেদে “গনতন্ত্র ও মৌলিক মানবাধিকারের” নিশ্বয়তা দেয়া আছে?\n" +
                    "\n" +
                    "উঃ- ১১ অনুচ্ছেদ।\n" +
                    "\n" +
                    "৩৬) সংবিধানের কোন অনুচ্ছেদে “কৃষক ও শ্রমিকের” মুক্তির কথা বলা আছে?\n" +
                    "\n" +
                    "উঃ- ১৪ অনুচ্ছেদ।\n" +
                    "\n" +
                    "৩৭) সংবিধানের কোন অনুচ্ছেদে“নির্বাহী বিভাগ থেকে বিচার বিভাগ পৃথকীকরণ” এর কথা বলা হয়েছে?\n" +
                    "\n" +
                    "উঃ- ২২ অনুচ্ছেদ।\n" +
                    "\n" +
                    "৩৮) “সকল নাগরিক আইনের চোখে সমান এবং আইনের সমান আশ্রয় লাভের অধিকারী” বর্ণিত কোন অনুচ্ছেদে?\n" +
                    "\n" +
                    "উঃ- ২৭ অনুচ্ছেদে।\n" +
                    "\n" +
                    "৩৯) জীবন ও ব্যক্তি স্বাধীনতার অধিকার রক্ষিত রয়েছে কোন অনুছেদে?\n" +
                    "\n" +
                    "উঃ- ৩য় ভাগে, ৩২ অনুচ্ছেদে।\n" +
                    "\n" +
                    "৪০) গ্রেফতার ও আটক সম্পর্কিত রক্ষাকবচের কোন অনুচ্ছেদ?\n" +
                    "\n" +
                    "উঃ- ৩য় ভাগে, ৩৩ অনুচ্ছেদে।\n" +
                    "\n" +
                    "৪১) জবরদস্তি নিষিদ্ধ করা হয়েছে কোন অনুচ্ছেদে?\n" +
                    "\n" +
                    "উঃ- ৩য় ভাগে, ৩৪ অনুচ্ছেদে।\n" +
                    "\n" +
                    "৪২) চলাফেরার স্বাধীনতা দেয়া হয়েছে কোন অনুচ্ছেদে?\n" +
                    "\n" +
                    "উঃ- ৩য় ভাগে, ৩৬ অনুচ্ছেদে।\n" +
                    "\n" +
                    "৪৩) সমাবেশের স্বাধীনতা দেয়া হয়েছে কোন অনুচ্ছেদে?\n" +
                    "\n" +
                    "উঃ- ৩য় ভাগে, ৩৭ অনুচ্ছেদে।\n" +
                    "\n" +
                    "৪৪) সমিতি ও সংঘ গঠনের স্বাধীনতা দেয়া হয়েছে কোন অনুচ্ছেদে?\n" +
                    "\n" +
                    "উঃ- ৩য় ভাগে, ৩৮ অনুচ্ছেদে।\n" +
                    "\n" +
                    "৪৫) চিন্তা ও বিবেকের স্বাধীনতা দেয়া হয়েছে কোন অনুচ্ছেদে?\n" +
                    "\n" +
                    "উঃ- ৩য় ভাগে, ৩৯ (১) অনুচ্ছেদে।\n" +
                    "\n" +
                    "৪৬) বাক ও ভাব প্রকাশের স্বাধীনতা দেয়া হয়েছে কোন অনুছেদে?\n" +
                    "\n" +
                    "উঃ- ৩য় ভাগে, ৩৯(২) ক অনুচ্ছেদে।\n" +
                    "\n" +
                    "৪৭) সংবাদপত্রের স্বাধীনতা দেয়া হয়েছে কোন অনুছেদে?\n" +
                    "\n" +
                    "উঃ- ৩য় ভাগে, ৩৯ (২) খ অনুচ্ছেদে।\n" +
                    "\n" +
                    "৪৮) পেশা ও বৃত্তির স্বাধীনতা দেয়া হয়েছে কোন অনুছেদে?\n" +
                    "\n" +
                    "উঃ- ৩য় ভাগে, ৪০ অনুচ্ছেদে।\n" +
                    "\n" +
                    "৪৯) ধর্মীয় স্বাধীনতার কথা বলা হয়েছে কোন অনুছেদে?\n" +
                    "\n" +
                    "উঃ- ৩য় ভাগে, ৪১ অনুচ্ছেদে।\n" +
                    "\n" +
                    "৫০) সম্পত্তির অধিকারের কথা বর্ণিত হয়েছে কোন অনুছেদে?\n" +
                    "\n" +
                    "উঃ- ৩য় ভাগে, ৪২ অনুচ্ছেদে।\n" +
                    "\n" +
                    "৫১) স্পিকার ও ডেপুটি স্পিকার সংক্রান্ত অনুচ্ছেদ কোনটি?\n" +
                    "\n" +
                    "উঃ- ৭৪ অনুচ্ছেদ।\n" +
                    "\n" +
                    "৫২) ন্যায়পাল নিয়োগ সংক্রান্ত কথা বলা হয়েছে?\n" +
                    "\n" +
                    "উঃ- ৭৭ অনুচ্ছেদে।\n" +
                    "\n" +
                    "৫৩) জাতীয় সংসদে ন্যায়পাল আইন কবে পাস হয়?\n" +
                    "\n" +
                    "উঃ- ১৯৮০ সালে।\n" +
                    "\n" +
                    "৫৪) বাংলাদশের সংবিধানের এ পর্যন্তু মোট কতটি সংশোধনী আনা হয়েছে?\n" +
                    "\n" +
                    "উঃ- ১৬ টি।\n" +
                    "\n" +
                    "৫৫) ইনডেমনিটি অধ্যাদেশ কবে জারী করা হয়?\n" +
                    "\n" +
                    "উঃ- ২৬ সেপ্টেম্বর, ১৯৭৫।\n" +
                    "\n" +
                    "৫৬) ইনডেমনিটি অধ্যাদেশ কবে বাতিল করা হয়?\n" +
                    "\n" +
                    "উঃ- ১২ নভেম্বর, ১৯৯৬।\n" +
                    "\n" +
                    "৫৮) বাংলাদেশের আইন সভার নাম কি?\n" +
                    "\n" +
                    "উঃ- জাতীয় সংসদ।\n" +
                    "\n" +
                    "৫৯) জাতীয় সংসদ ভবনের ভিত্তিপ্রস্তর কবে স্থাপন করা হয়?\n" +
                    "\n" +
                    "উঃ- ১৯৬২ সালে।\n" +
                    "\n" +
                    "৬০) জাতীয় সংসদ ভবনের স্থপতি কে?\n" +
                    "\n" +
                    "উঃ- লুই আই কান।\n" +
                    "\n" +
                    "৬১) লুই আই কান কোন দেশের নাগরিক?\n" +
                    "\n" +
                    "উঃ- যুক্তরাষ্ট্রের নাগরিক।\n" +
                    "\n" +
                    "৬২) জাতীয় সংসদ ভবনের ছাদ ও দেয়ালের স্ট্রাকচারাল ডিজাইনার কে?\n" +
                    "\n" +
                    "উঃ- হ্যারি পাম ব্লুম।\n" +
                    "\n" +
                    "৬৩) জাতীয় সংসদ ভবনের নির্মাণ কাজ শুরু হয় কবে?\n" +
                    "\n" +
                    "উঃ- ১৯৬৫ সালে।\n" +
                    "\n" +
                    "৬৪) জাতীয় সংসদ ভবনের ভূমির পরিমান কত?\n" +
                    "\n" +
                    "উঃ- ২১৫ একর।\n" +
                    "\n" +
                    "৬৫) জাতীয় সংসদ ভবন উদ্বোধন করা হয়?\n" +
                    "\n" +
                    "উঃ- ২৮ জানুয়ারী, ১৯৮২।\n" +
                    "\n" +
                    "৬৬) জাতীয় সংসদ ভবন কত তলা বিশিষ্ট?\n" +
                    "\n" +
                    "উঃ- ৯ তলা।\n" +
                    "\n" +
                    "৬৭) জাতীয় সংসদ ভবনের উচ্চতা কত?\n" +
                    "\n" +
                    "উঃ- ১৫৫ ফুট।\n" +
                    "\n" +
                    "৬৮) বাংলাদেশের জাতীয় সংসদের প্রতীক কি?\n" +
                    "\n" +
                    "উঃ- শাপলা ফুল।\n" +
                    "\n" +
                    "৬৯) জাতীয় সংসদ ভবন কে উদ্বোধন করেন?\n" +
                    "\n" +
                    "উঃ- রাষ্ট্রপতি আব্দুস সাত্তার।\n" +
                    "\n" +
                    "৭০) বর্তমান জাতীয় সংসদের প্রথম অধিবেশন কবে বসে?\n" +
                    "\n" +
                    "উঃ- ১৫ ফেব্রুয়ারী, ১৯৮২।\n" +
                    "\n" +
                    "৭১) বাংলাদেশের সংসদের মোট আসন সংখ্যা কতটি?\n" +
                    "\n" +
                    "উঃ- ৩৫০ টি।\n" +
                    "\n" +
                    "৭২) বাংলাদেশের সংসদের সাধারন নির্বাচিত আসন সংখ্যা কতটি?\n" +
                    "\n" +
                    "উঃ- ৩০০ টি।\n" +
                    "\n" +
                    "৭৩) সংসদে মহিলাদের জন্য সংরক্ষিত আসন স্যখ্যা কতটি?\n" +
                    "\n" +
                    "উঃ- ৫০ টি।\n" +
                    "\n" +
                    "৭৪) বাংলাদেশের জাতীয় সংসদের ১ নং আসন কোনটি?\n" +
                    "\n" +
                    "উঃ- পঞ্চগড়-১।\n" +
                    "\n" +
                    "৭৫) বাংলাদেশের জাতীয় সংসদের ৩০০ নং আসন কোনটি?\n" +
                    "\n" +
                    "উঃ- বান্দরবান।\n" +
                    "\n" +
                    "৭৬) জাতীয় সংসদের কাস্টি ভোট বলা হয়?\n" +
                    "\n" +
                    "উঃ- স্পিকারের ভোটকে।\n" +
                    "\n" +
                    "৭৭) সংসদের এক অধিবেশনের সমাপ্তি ও পরবর্তী অধিবেশনের প্রথম বৈঠকের মধ্যে ব্যবধান কতদিন?\n" +
                    "\n" +
                    "উঃ- ৬০ দিন।\n" +
                    "\n" +
                    "৭৮) গণতন্ত্র ও মানবাধিকার এবং মৌলিক অধিকার বলবৎকরন কোন কোন অনুচ্ছেদে বলা হয়েছে?\n" +
                    "\n" +
                    "উত্তর: যথাক্রমে ১১ ও ৪৪ অনুচ্ছেদ।\n" +
                    "\n" +
                    "৭৯) সাধারন নির্বাচনের কতদিনের মধ্যে সংসদ অধিবশন আহবান করতে হবে?\n" +
                    "\n" +
                    "উঃ- ৩০ দিন।\n" +
                    "\n" +
                    "৮০) সংসদ অধিবেশন কে আহবান করেন?\n" +
                    "\n" +
                    "উঃ- রাষ্ট্রপতি।\n" +
                    "\n" +
                    "৮১) সংসদ অধিবেশনের কোরাম পূর্ন হয় কত জন সংসদ হলে?\n" +
                    "\n" +
                    "উঃ- ৬০ জন।\n" +
                    "\n" +
                    "৮২) সংবিধান সংশোধনের জন্য কত সংসদ সদস্যের ভোটের প্রয়োজন হয়?\n" +
                    "\n" +
                    "উঃ- দুই-তৃতীয়াংশ।\n" +
                    "\n" +
                    "৮৩) একাধারে কতদিন সংসদে অনুপস্থিত থাকলে সংসদ সদস্য পদ বাতিল হয়?\n" +
                    "\n" +
                    "উঃ- ৯০ কার্যদিবস।\n" +
                    "\n" +
                    "৮৪) গণ-পরিষদের প্রথম স্পিকার কে?\n" +
                    "\n" +
                    "উঃ- শাহ আব্দুল হামিদ।\n" +
                    "\n" +
                    "৮৫) গণ-পরিষদের প্রথম ডেপুটি স্পিকার কে?\n" +
                    "\n" +
                    "উঃ- মোহাম্মদ উল্ল্যাহ।\n" +
                    "\n" +
                    "৮৬) এ দেশের সংসদীয় রাজনীতির ইতিহাস কবে থেকে চর্চা শুরু হয়?\n" +
                    "\n" +
                    "উঃ- ১৯৩৭ সালে।\n" +
                    "\n" +
                    "৮৭) কোন কোন বিদেশী প্রথম জাতীয় সংসদে ভাষণ দেন?\n" +
                    "\n" +
                    "উঃ- যুগোশ্লেভিয়ার প্রেসিডেন্ট মার্শাল জোসেফ টিটো-৩১ জানু, ১৯৭৪ এবং ভারতের প্রেসিডেন্ট ভি.ভি.\n" +
                    "\n" +
                    "গিরি-১৮ জুন, ১৯৭৪।\n" +
                    "\n" +
                    "৮৮) বাংলাদেশের অষ্টম জাতীয় সংসদ নিবার্চনে নির্বাচিত একজন সদস্য নিজেই নিজের শপথ বাক্য পাঠ করিয়েছেন, তিনি কে?\n" +
                    "\n" +
                    "উঃ- এডভোকেট আবদুল হামিদ।\n" +
                    "\n" +
                    "৮৯) নির্বাচন কমিশন কার সমমর্যাদার অধিকারী?\n" +
                    "\n" +
                    "উঃ- সুপ্রীম কোর্ট।\n" +
                    "\n" +
                    "৯০) বাংলাদেশের প্রথম নির্বাচন কমিশনার কে?\n" +
                    "\n" +
                    "উঃ- বিচারপতি এম ইদ্রিস।\n" +
                    "\n" +
                    "৯১) বাংলাদেশের বর্তমান নির্বাচন কমিশনার কে?\n" +
                    "\n" +
                    "উঃ- কাজী রকিবউদ্দীন আহমদ\n" +
                    "\n" +
                    "৯২) নির্বাচন কমিশন কেমন প্রতিষ্ঠান?\n" +
                    "\n" +
                    "উঃ- স্বতন্ত্র ও নিরপেক্ষ প্রতিষ্ঠান।\n" +
                    "\n" +
                    "৯৩) “তত্ত্বাবধায়ক সরকার বিল” কবে সংসদে পাশ হয়?\n" +
                    "\n" +
                    "উঃ- ২৭ মার্চ, ১৯৯৬।\n" +
                    "\n" +
                    "৯৪) বাংলাদেশের প্রথম রাষ্ট্রপতি কে?\n" +
                    "\n" +
                    "উঃ- সৈয়দ নজরুল ইসলাম (অস্থায়ী)।\n" +
                    "\n" +
                    "৯৫) এডভোকেট আবদুল হামিদ বাংলাদেশের কততম প্রেসিডেন্ট?\n" +
                    "\n" +
                    "উঃ- ২০তম।\n" +
                    "\n" +
                    "৯৬) বাংলাদেশের প্রথম প্রধানমন্ত্রী কে?\n" +
                    "\n" +
                    "উঃ- তাজউদ্দিন আহমেদ।\n" +
                    "\n" +
                    "৯৭) শেখ হাসিনা বর্তমানে বাংলাদেশের কততম প্রধানমন্ত্রী?\n" +
                    "\n" +
                    "উঃ- ১৪ তম।\n" +
                    "\n" +
                    "৯৮) বাংলাদেশের রাষ্ট্রপতি হতে হলে বয়স কমপক্ষে কত হবে?\n" +
                    "\n" +
                    "উঃ- ৩৫ বছর।\n" +
                    "\n" +
                    "৯৯) বাংলাদেশের প্রধানমন্ত্রী হতে হলে বয়স কমপক্ষে কত হতে হবে?\n" +
                    "\n" +
                    "উঃ- ২৫ বছর।\n" +
                    "\n" +
                    "১০০) জাতীয় সংসদের সদস্য হতে হলে বয়স কমপক্ষে কত হতে হবে?\n" +
                    "\n" +
                    "উঃ- ২৫ বছর।");
            setTitle("সাংবিধান বিষয়ক প্রশ্ন উত্তর");

        }


        else if(selector==12)
        {
            tv1.setText("বাংলাদেশ সংবিধান বিসিএস পরীক্ষার্থীদের জন্য অন্যতম গুরুত্বপূর্ণ একটি অধ্যায়। কারন " +
                    "সংবিধান থেকে প্রিলিমিনারি, লিখিত ও ভাইভাতে প্রশ্ন আসে। প্রিলিমিনারিতে তিনটি প্রশ্ন আসার " +
                    "কথা বলা হয়েছে। লিখিত ও ভাইভাতে কয়টি প্রশ্ন আসবে তা বলা কঠিন। ৩৪তম বিসিএসে " +
                    "লিখিত বাংলাদেশ বিষয়াবলীতে ৪০ নম্বর এসেছিল সংবিধান থেকে। তাই সংবিধান ভাল করে " +
                    "পড়তে হবে।\n" +
                    "\n" +
                    "সংবিধানের তিনটি অংশ বা দিক থেকে প্রশ্ন করা হয়ে থাকে। যথা-\n" +
                    "ক) সংবিধান প্রনয়নের ইতিহাস\n" +
                    "খ) গুরুত্বপূর্ণ অনুচ্ছেদ\n" +
                    "গ) সংবিধান সংশোধনীসমূহ\n" +
                    "\n" +
                    "প্রথমেই আপনাকে সংবিধান প্রনয়নের সাথে কারা জড়িত ছিল, খসড়া অবস্থা, উপস্থাপনের " +
                    "তারিখ, গৃহীত হওয়ার তারিখ, স্বাক্ষরকারীগন, অধ্যাদেশ জারি, কমিটি গঠনের প্রেক্ষাপট, কে " +
                    "স্বাক্ষর করল না, মহিলা ছিল কিনা, অঙ্গসজ্জা কে করল, কে হাতে লিখল, কোন দেশের সংবিধান " +
                    "অনুসরন করল ইত্যাদি সব জেনে নিতে হবে।\n" +
                    "\n" +
                    "এবার আসেন অনুচ্ছেদ এ। মোট ১৫৩ টি অনুচ্ছেদ এবং ৭ টি তফসিল আছে। সব মনে রাখা " +
                    "কঠিন। আবার সব পরীক্ষায় আসেও না। আপনি তো সংবিধান বিশেষজ্ঞ হবেন না। আপাতত " +
                    "পরীক্ষার তরীটা পার করাই আপনার উদ্দেশ্য। সংবিধানের সবেচেয় গুরুত্বপূর্ন অংশ হলো " +
                    "সংবিধানের মূলনীতি, রাষ্ট্র পরিচালনার মূলনীতি ও মৌলিক অধিকার। এর পরের অংশগুলো " +
                    "বাছাই করে পড়তে হবে। ১৫৩ অনুচ্ছেদের মধ্যে নিচের অনুচ্ছেদগুলো ভাল করে পড়তে হবে। " +
                    "যথা- ২(ক), ৩, ৪, ৪(ক), ৫, ৬, ৯, ১০, ১১, ১২, ১৩, ১৪, ১৫, ১৬,১৭, ১৮, ১৮ (ক) ১৯, ২০, " +
                    "২১, ২২, ২৩, ২৩(ক), ২৪, ২৫, ২৭, ২৮, ২৯, ৩০, ৩১, ৩২, ৩৩, ৩৪, ৩৫, ৩৬, ৩৭, ৩৮, ৩৯, " +
                    "৪০, ৪১, ৪২, ৪৩, ৪৯, ৫২, ৫৫, ৫৭, ৫৯, ৬০, ৬৪, ৬৫, ৬৬, ৬৭, ৭০, ৭৬, ৭৭, ৮১, ৮৭, " +
                    "৯১, ৯৩, ৯৪, ১০২, ১০৬, ১০৮, ১১৭, ১১৮, ১২১, ১২২, ১২৩, ১২৭, ১৩৭, ১৩৮, ১৩৯, ১৪০, " +
                    "১৪১, ১৪১ (ক), ১৪১(খ), ১৪১(গ), ১৪২, ১৪৮, ১৫৩.\n" +
                    "এই অনুচ্ছেদগুলো লিখিত ও ভাইভার ক্ষেত্রেও প্রযোজ্য। এর চেয়ে কমানো হলে বিপদে পড়ে " +
                    "যাবেন। সাতটি তফসিলের মধ্যে তৃতীয়, পজ্ঞম, ষষ্ঠ ও সপ্তম তফসিল ভাল করে পড়বেন।" +
                    "\n" +
                    "বাংলাদেশ সংবিধান এ পর্যন্ত ১৬ বার সংশোধিত হয়েছে। এটি পরিবর্তনযোগ্য। তাই খেয়াল " +
                    "রাখতে হবে। এই সংশোধনীর কিছু আবার বাতিল ঘোষনা করা হয়েছে। দ্বিতীয়, তৃতীয়, চতুর্থ, " +
                    "অষ্টম, দ্বাদশ, ত্রয়োদশ (বাতিল), চতুর্দশ, পজ্ঞদশ, ষোড়শ সংশোধনী ভাল করে পড়বেন। " +
                    "সালটা আর মূল বিষয়বস্তু মনে রাখবেন। তবেই হবে।\n" +
                    "\n" +
                    "অনেকেই বলে, পড়ি কিন্তু মনে থাকে না। তাদের বলছি। অনুচ্ছেদ দিয়ে ফ্লাশ কার্ড বানিয়ে " +
                    "নিন। বাইরে যাওয়ার সময় নিয়ে যাবেন। আর একটা কথা, সংবিধান একদম সংবিধানের ভাষায় " +
                    "পড়তে হবে বা লিখতে হবে এমন কোন কথা নেই। চলিত ভাষায় আপনার মত করে লিখবেন বা " +
                    "বলবেন। কোন সমস্যা নেই। তবে মূলভাব যেন সঠিক থাকে।\n" +
                    "সংবিধান পড়ার জন্য আপনি যে বই বা গাইড অনুসরন করতে পারেন। যারা একটু বেশি অলস " +
                    "তারা পড়বেন (ক) ছন্দে ছন্দে সংবিধান (মো: আসাদুজ্জামান)। আর যারা কম অলস মানে " +
                    "শরীর নাড়াচাড়া ভালোই করেন তারা পড়বেন (ক) আরিফ খানের লেখা বাংলাদেশ সংবিধান " +
                    "বইটা। আর কি হয়ে গেল। আসলে ভাল প্রস্তুতির জন্য বেশি বই লাগে না; লাগে বেশি পড়াশুনা। " +
                    "সেটা করার ইচ্ছা আছে তো আপনার? তবেই হয়ে গেছে। আরে হ্যা হয়ে গেছে। আর একটা কথা " +
                    "আপনি যদি ইংরেজীতে খুব বেশি ভাল না হন তবে ইংরেজীতে সংবিধান না পড়া বা লেখাই ভাল। " +
                    "হিতে বিপরীত হতে পারে। তাই সময় নষ্ট না করে পড়া শুরু করে দিন। সংবিধান মনে রাখার চেষ্টা " +
                    "করুন। একে উপেক্ষা করে ভাল করার কোন সুযোগ নেই। সবার জন্য শুভ কামনা রইল।\n" +
                    "\n" +
                    "লেখক:\n" +
                    "\n" +
                    "শাহ মো. সজীব\n" +
                    "\n" +
                    "প্রশাসন ক্যাডার (২য় স্থান), ৩৪তম বিসিএস\n" +
                    "\n");
            setTitle("সাংবিধান বিষয়ক পরামর্শ");

        }

        else if(selector==13)
        {
            tv1.setText("প্রথম সংশোধনী আইন  ১৯৭৩ সালের ১৫ জুলাই সংবিধান (প্রথম সংশোধনী) আইন, ১৯৭৩ গৃহীত হয়। এই সংশোধনীর দ্বারা সংবিধানের ৪৭ অনুচ্ছেদে একটি অতিরিক্ত দফা সংযুক্ত করা হয়, যা ‘গণহত্যা, মানবতার বিরুদ্ধে অপরাধ বা যুদ্ধাপরাধ এবং আন্তর্জাতিক আইনে অন্যান্য অপরাধ’-এর দায়ে যে কোনো ব্যক্তির বিচার ও শাস্তি অনুমোদন করে। ৪৭ অনুচ্ছেদের পরে একটি নতুন অনুচ্ছেদ ৪৭ক সংযুক্ত করা হয়, যাতে সুনির্দিষ্ট করে বলা হয় যে, উপরে বর্ণিত অপরাধসমূহের ক্ষেত্রে কতিপয় মৌলিক অধিকার প্রযোজ্য হবে না।\n\n\n" +
                    "দ্বিতীয় সংশোধনী আইন সংবিধান (দ্বিতীয় সংশোধনী)  আইন, ১৯৭৩ গৃহীত হয় ১৯৭৩ সালের ২২ সেপ্টেম্বর। এই আইনের ফলে (১) সংবিধানের ২৬, ৬৩, ৭২ ও ১৪২ নং অনুচ্ছেদ সংশোধিত হয়; (২) ৩৩ অনুচ্ছেদ প্রতিস্থাপিত হয়, এবং (৩) সংবিধানে একটি নতুন ভাগ, যথা ভাগ ৯ক সংযুক্ত হয়। এই সংশোধনীর মাধ্যমে জরুরি অবস্থাকালীন সময়ে নাগরিকদের কতিপয় মৌলিক অধিকার স্থগিত করা হয়।\n\n" +
                    "\nতৃতীয় সংশোধনী আইন সংবিধান (তৃতীয় সংশোধনী) আইন ১৯৭৪ বলবৎ হয় ১৯৭৪ সালের ২৮ নভেম্বর। এর দ্বারা বাংলাদেশ ও ভারতের মধ্যে কতিপয় ছিটমহল বিনিময় ও সীমান্ত রেখা নির্ধারণের ব্যাপারে একটি চুক্তি কার্যকর করার লক্ষ্যে সংবিধানের ২ অনুচ্ছেদে পরিবর্তন আনা হয়।\n\n" +
                    "\nচতুর্থ সংশোধনী আইন সংবিধান (চতুর্থ সংশোধনী) আইন ১৯৭৫ গৃহীত হয় ১৯৭৫ সালের ২৫ জানুয়ারি। এই সংশোধনীর দ্বারা সংবিধানে কতিপয় বড় পরিবর্তন আনা হয়। সংসদীয় ব্যবস্থার পরিবর্তে রাষ্ট্রপতি শাসিত সরকার ব্যবস্থা প্রবর্তিত হয়; বহুদলীয় রাজনৈতিক ব্যবস্থার স্থলে আনা হয় একদলীয় ব্যবস্থা; জাতীয় সংসদের কতক ক্ষমতা খর্ব করা হয়; বিচার বিভাগের স্বাধীনতা অনেকটা খর্ব হয়; সুপ্রিম কোর্ট নাগরিকদের মৌলিক অধিকারসমূহ রক্ষা ও প্রয়োগের এখতিয়ার থেকে বঞ্চিত হয়। এই আইন দ্বারা (১) সংবিধানের ১১, ৬৬, ৬৭, ৭২, ৭৪, ৭৬, ৮০, ৮৮, ৯৫, ৯৮, ১০৯, ১১৬, ১১৭, ১১৯, ১২২, ১২৩, ১৪১ক এবং ১৪৮ অনুচ্ছেদ সংশোধন করা হয়; (২) ৪৪, ৭০, ১০২, ১১৫ ও ১২৪ অনুচ্ছেদ প্রতিস্থাপন করা হয়; (৩) সংবিধানের তৃতীয় ভাগ সংশোধন করা হয়; (৪) তৃতীয় ও চতুর্থ তফসিল পরিবর্তন করা হয়; (৫) প্রথম জাতীয় সংসদের মেয়াদ বৃদ্ধি করা হয়; (৬) রাষ্ট্রপতির পদ ও এই পদের প্রার্থী সম্পর্কে বিশেষ বিধান করা হয়; (৭) সংবিধানে একটি নতুন (একাদশ) ভাগ সংযুক্ত করা হয়; এবং (৮) সংবিধানে ৭৩ক ও ১১৬ক অনুচ্ছেদ দুটি সংযুক্ত করা হয়।\n\n" +
                    "\nপঞ্চম সংশোধনী আইন  এই সংবিধান আইন জাতীয় সংসদে অনুমোদিত হয় ১৯৭৯ সালের ৬ এপ্রিল। এই আইন দ্বারা সংবিধানের চতুর্থ তফসিলের সংশোধন করা হয় এবং তাতে ১৮ প্যারাগ্রাফ নামে একটি নতুন প্যারাগ্রাফ যুক্ত করা হয়। এতে বলা হয় যে, ১৯৭৫ সালের ১৫ আগস্ট তারিখসহ ওই দিন থেকে ১৯৭৯ সালের ৯ এপ্রিল তারিখ পর্যন্ত (ওই দিনসহ) সামরিক আইন কর্তৃপক্ষের যে কোনো ঘোষণা বা আদেশ বলে সম্পাদিত সংবিধানের সকল সংশোধনী, সংযুক্তি, পরিবর্তন, প্রতিস্থাপন ও বিলুপ্তি বৈধভাবে সম্পাদিত বলে বিবেচিত হবে এবং কোনো কারণেই কোনো আদালত বা ট্রাইব্যুনালে এসবের ব্যাপারে কোনো প্রশ্ন তোলা যাবে না।\n\n" +
                    "\nষষ্ট সংশোধনী আইন  ১৯৮১ সালের সংবিধানের ৫১ ও ৬৬ অনুচ্ছেদ সংশোধনের লক্ষ্যে জাতীয় সংসদ কর্তৃক এই আইন কার্যকর হয়।\n\n" +
                    "\nসপ্তম সংশোধনী আইন  ১৯৮৬ সালের ১১ নভেম্বর এই আইন পাস হয়। এই আইন দ্বারা সংবিধানের ৮৬ অনুচ্ছেদ সংশোধন করা হয়; এর দ্বারা সংবিধানের চতুর্থ তফসিলের সংশোধন করা হয় এবং তাতে ১৯ প্যারাগ্রাফ নামে একটি নতুন প্যারাগ্রাফ যুক্ত করা হয়। এতে বলা হয় যে, ১৯৮২ সালের ২৪ মার্চ তারিখসহ ওই দিন থেকে ১৯৮৬ সালের ১১ নভেম্বর পর্যন্ত (ঐ দিনসহ) সময়কালের মধ্যে গৃহীত সকল ঘোষণা, ঘোষণা আদেশ, প্রধান সামরিক আইন প্রশাসকের আদেশ, সামরিক আইন বিধানাবলি, সামরিক আইন আদেশসমূহ, সামরিক আইন নির্দেশনাসমূহ, অধ্যাদেশসমূহ এবং অন্যান্য আইন বৈধভাবে সম্পাদিত বলে বিবেচিত হবে এবং কোনো কারণে এসবের বিরুদ্ধে কোনো আদালত, ট্রাইব্যুনাল বা কোনো কর্তৃপক্ষের কাছে কোনো প্রশ্ন তোলা যাবে না।\n\n" +
                    "\nঅষ্টম সংশোধী আইন  ১৯৮৮ সালের ৭ জুন এই সংশোধনী আইন পাস হয়। এর দ্বারা সংবিধানের ২, ৩, ৫, ৩০ ও ১০০ অনুচ্ছেদ সংশোধন করা হয়। এই সংশোধনী আইনবলে (১) ইসলাম রাষ্ট্রধর্ম হিসেবে ঘোষিত হয়; (২) ঢাকার বাইরে হাইকোর্ট বিভাগের ছয়টি স্থায়ী বেঞ্চ স্থাপনের মধ্য দিয়ে বিচার বিভাগের বিকেন্দ্রীকরণ করা হয়; (৩) সংবিধানের ৫ অনুচ্ছেদে Bengali শব্দটি পরিবর্তন করে Bangla করা হয় এবং Dacca পরিবর্তন করে Dhaka করা হয়; (৪) সংবিধানের ৩০ অনুচ্ছেদ সংশোধন করে বাংলাদেশের রাষ্ট্রপতির পূর্বানুমতি ছাড়া এদেশের কোনো নাগরিক কর্তৃক কোনো বিদেশী রাষ্ট্রের প্রদত্ত কোনো খেতাব, সম্মাননা, পুরস্কার বা অভিধা গ্রহণ নিষিদ্ধ করা হয়। উল্লেখ করা যেতে পারে যে, পরবর্তী সময়ে সুপ্রীম কোর্ট সংবিধানের ১০০ অনুচ্ছেদের সংশোধনীকে অসাংবিধানিক ঘোষণা করে, কারণ তার দ্বারা সংবিধানের মৌলিক কাঠামো পরিবর্তিত হয়েছে।\n\n" +
                    "\nনবম সংশোধনী আইন  সংবিধান আইন ১৯৮৯ (নবম সংশোধনী) পাস হয় ১৯৮৯ সালের জুলাই মাসে। এই সংশোধনী দ্বারা রাষ্ট্রের উপ-রাষ্ট্রপতি পদে প্রত্যক্ষ নির্বাচনের বিধান করা হয়; রাষ্ট্রপতির পদে একই ব্যক্তির দায়িত্ব পালন পর পর দুই মেয়াদের মধ্যে সীমাবদ্ধ করা হয় (প্রতি মেয়াদকাল ৫ বছর)। এই সংশোধনীতে আরও বলা হয় যে, শূণ্যতা সৃষ্টি হলে একজন উপ-রাষ্ট্রপতি নিয়োগ করা যেতে পারে, তবে সেই নিয়োগের পক্ষে জাতীয় সংসদের অনুমোদন আবশ্যক হবে।\n\n" +
                    "\nদশম সংশোধনী আইন  ১৯৯০ সালের ১২ জুন দশম সংশোধনী আইন কার্যকর হয়। এর দ্বারা, অন্যান্যের মধ্যে, সংবিধানের ৬৫ অনুচ্ছেদ সংশোধন করে পরবর্তী ১০ বছরের জন্য জাতীয় সংসদে নারীদের জন্য ৩০টি আসন সংরক্ষণের বিধান করা হয়, যেসব আসনে নারীরা নির্বাচিত হবেন সংসদ সদস্যদের ভোটে।\n\n" +
                    "\nএকাদশ সংশোধনী আইন  এই আইন পাস হয় ১৯৯১ সালের ৬ আগস্ট। এ আইনবলে সংবিধানের চতুর্থ তফসিল সংশোধন করা হয় এবং তাতে ২১ নং নতুন প্যারাগ্রাফ সংযুক্ত করা হয়; এই প্যারাগ্রাফ বাংলাদেশের উপ-রাষ্ট্রপতি পদে প্রধান বিচারপতি সাহাবুদ্দীন আহমদের নিয়োগ ও শপথ গ্রহণ এবং ১৯৯০ সালের ৬ ডিসেম্বর তাঁর নিকট রাষ্ট্রপতি এইচ.এম এরশাদের পদত্যাগ পত্র পেশ, এবং নির্বাচিত রাষ্ট্রপতি আব্দুর রহমান বিশ্বাস কর্তৃক ১৯৯১ সালের ৯ অক্টোবর রাষ্ট্রপতি পদে দায়িত্ব গ্রহণকে বৈধতা দান করে। এই সংশোধনী আইন ১৯৯০ সালের ৬ ডিসেম্বর থেকে ১৯৯১ সালের ৯ অক্টোবর সময়কালের মধ্যে অস্থায়ী রাষ্ট্রপতি হিসেবে উপ-রাষ্ট্রপতি কর্তৃক প্রয়োগকৃত সকল ক্ষমতা, প্রবর্তিত সকল আইন ও অধ্যাদেশ, জারিকৃত সকল আদেশ ও আইন এবং গৃহীত সকল পদক্ষেপ ও কার্যপ্রণালীকে অনুমোদন দেয়, নিশ্চিত করে ও বৈধতা দেয়। এই আইন অস্থায়ী রাষ্ট্রপতির দায়িত্ব পালন শেষে বিচারপতি সাহাবুদ্দীন আহমদের পূর্ববর্তী পদ, অর্থাৎ বাংলাদেশের প্রধান বিচারপতির পদে প্রত্যাবর্তনকে সম্ভব করে ও এ ব্যাপারে নিশ্চয়তা দেয়।\n\n" +
                    "\nদ্বাদশ সংশোধনী আইন  বাংলাদেশের সাংবিধানিক বিকাশের ইতিহাসে সর্বাধিক গুরুত্বপূর্ণ মাইলফলক হিসেবে খ্যাত এই সংশোধনী আইন পাস হয় ১৯৯১ সালের ৬ আগস্ট। এর দ্বারা সংবিধানের ৪৮, ৫৫, ৫৬, ৫৮, ৫৯, ৬০, ৭০, ৭২. ১০৯, ১১৯, ১২৪, ১৪১ক এবং ১৪২ অনুচ্ছেদ সংশোধন করা হয়। এই সংশোধনীর মাধ্যমে বাংলাদেশে সংসদীয় সরকার পদ্ধতির পুনঃপ্রবর্তন ঘটে; রাষ্ট্রপতি রাষ্ট্রের সাংবিধানিক প্রধান হন; প্রধানমন্ত্রী হন রাষ্ট্রের প্রধান নির্বাহী; প্রধানমন্ত্রীর নেতৃত্বে মন্ত্রিপরিষদ জাতীয় সংসদের কাছে দায়বদ্ধ হয়; উপ-রাষ্ট্রপতির পদ বিলোপ করা হয়, জাতীয় সংসদের সদস্যদের ভোটে রাষ্ট্রপতি নির্বাচনের বিধান করা হয়। তাছাড়া, সংবিধানের ৫৯ অনুচ্ছেদের মাধ্যমে এই আইনে স্থানীয় সরকার কাঠামোতে জনপ্রতিনিধিদের অংশগ্রহণ নিশ্চিত করা হয়, যা দেশে গণতন্ত্রের ভিত্তি সুদৃঢ় করে।\n\n" +
                    "\nত্রয়োদশ সংশোধনী আইন  সংবিধান আইন ১৯৯৬ (ত্রয়োদশ সংশোধনী) পাস হয় ১৯৯৬ সালের ২৬ মার্চ। এর দ্বারা একটি নির্দলীয় তত্ত্বাবধায়ক সরকার ব্যবস্থার বিধান করা হয়, যা একটি অন্তর্বর্তীকালীন প্রশাসন হিসেবে কাজ করবে এবং সুষ্ঠু, অবাধ ও নিরপেক্ষভাবে জাতীয় সংসদের নির্বাচন অনুষ্ঠানে নির্বাচন কমিশনকে সর্বতোভাবে সাহায্য-সহযোগিতা করবে। একজন প্রধান উপদেষ্টা ও অনূর্ধ্ব ১০ জন উপদেষ্টার সমন্বয়ে গঠিতব্য তত্ত্বাবধায়ক সরকার সমষ্টিগতভাবে রাষ্ট্রপতির নিকট দায়বদ্ধ থাকবে এবং নতুন সংসদ গঠনের পর নতুন সরকারের প্রধানমন্ত্রী দায়িত্ব গ্রহণের তারিখে বিলুপ্ত হবে।\n\n" +
                    "\nচতুর্দশ সংশোধনী আইন  সংবিধান আইন ২০০৪ (চতুর্দশ সংশোধনী) পাস হয় ২০০৪ সালের ১৬ মে। এই সংশোধনী দ্বারা অপরাপর বিষয়ের সঙ্গে নিম্নোক্ত বিধান সংযোজন করা হয় :জাতীয় সংসদে পরবর্তী দশ বছরের জন্য মহিলাদের জন্য সংরক্ষিত আসন ৩০ থেকে ৪৫-এ বর্ধিতকরণ; সুপ্রিম কোর্টের বিচারকদের অবসরগ্রহণের বয়স ৬৫ বছরের স্থলে ৬৭ বছর নির্ধারণ; রাষ্ট্রপতি ও প্রধানমন্ত্রীর অফিসে রাষ্ট্রপতি ও প্রধানমন্ত্রীর ছবি এবং সকল সরকারি, আধা-সরকারি ও স্বায়ত্তশাসিত সংস্থার অফিস এবং বিদেশে কুটনৈতিক মিশনে প্রধানমন্ত্রীর ছবি প্রদর্শন বাধ্যতামূলক করা হয়।\n\n" +
                    "\nপঞ্চদশ সংশোধনী আইন  সংবিধান আইন ২০১১ (পঞ্চদশ সংশোধনী) পাস হয় ২০১১ সালের ২৫ জুন। এই সংশোধনী দ্বারা সংবিধানে ধর্মনিরপেক্ষতা ও ধর্মীয় স্বাধীনতা পুনর্বহাল করা হয় এবং রাষ্টীয় মুলনীতি হিসেবে জাতীয়তাবাদ, সমাজতন্ত্র, গণতন্ত্র ও ধর্মনিরপেক্ষতার নীতি সংযোজন করা হয়। এই সংশোধনীর মাধ্যমে দেশের স্বাধীনতা যুদ্ধের নায়ক শেখ মুজিবুর রহমানকে জাতির জনক হিসেবে স্বীকৃতিও দেয়া হয়। এই সংশোধনীর দ্বারা তত্ত্বাবধায়ক সরকার ব্যবস্থা বাতিল করা হয়, জাতীয় সংসদে মহিলাদের জন্য সংরক্ষিত আসন সংখ্যা বিদ্যমান ৪৫-এর স্থলে ৫০ করা হয়। সংবিধানে ৭ অনুচ্ছেদের পরে ৭ (ক) ও ৭ (খ) অনুচ্ছেদ সংযোজন করে সংবিধান বহির্ভূত পন্থায় রাষ্টীয় ক্ষমতা দখলের পথ রুদ্ধ করা হয়। \n\n" +
                    "\nসংবিধান আইন ২০১৪ (ষোড়শ সংশোধনী) পাস হয় ২০১৪ সালের ১৭ সেপ্টেম্বর এবং ২২ সেপ্টেম্বর তা গেজেট আকারে প্রকাশ করা হয়। এই সংশোধনী দ্বারা সংবিধানের ৯৬ অনুচ্ছেদের সংশোধন করা হয়। গণপ্রজাতন্ত্রী বাংলাদেশের সংবিধানের ৯৬ অনুচ্ছেদের দফা (২), (৩), (৪), (৫), (৬), (৭), ও (৮) এর পরিবর্তে নিন্মরূপ দফা (২), (৩) ও (৪) প্রতিস্থাপিত হয়, যথা : “অনুচ্ছেদ ৯৬(২) প্রমাণিত অসদাচরণ বা অসামর্থ্যরে কারণে সংসদের মোট সদস্য-সংখ্যার অন্যূন দুই-তৃতীয়াংশ গরিষ্ঠতার দ্বারা সমর্থিত সংসদের প্রস্তাবক্রমে প্রদত্ত রাষ্ট্রপতির আদেশ ব্যতীত কোন বিচারককে অপসারিত করা যাবে না। অনুচ্ছেদ ৯৬(৩) এই অনুচ্ছেদের (২) দফার অধীন প্রস্তাব সম্পর্কিত পদ্ধতি এবং কোন বিচারকের অসদাচরণ বা অসামর্থ্য সম্পর্কে তদন্ত ও প্রমাণের পদ্ধতি সংসদ আইনের দ্বারা নিয়ন্ত্রণ করতে পারবে। অনুচ্ছেদ ৯৬(৪) কোন বিচারক রাষ্ট্রপতিকে উদ্দেশ্য করিয়া স্বাক্ষরযুক্ত পত্রযোগে স্বীয় পদত্যাগ করতে পারবে।” উত্থাপনকারী আইনমন্ত্রী অ্যাডভোকেট আনিসুল হক।\n\n"
            );
            setTitle("সাংবিধানিক সংশোধনী");

        }


    }
}
